Revit 2027 API
ParameterTypeId.PanelScheduleName Property
 "Panel Schedule Name"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PanelScheduleName { get; }
Public Shared ReadOnly Property PanelScheduleName As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PanelScheduleName {
	ForgeTypeId^ get ();
}
static member PanelScheduleName : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace